<details ><summary>Digger run report at 2025-10-08 18:47:33 (UTC)</summary>
                          <details ><summary>Error during init.</summary>

```terraform

```
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_ssm_parameter.dev_config will be created
  + resource "aws_ssm_parameter" "dev_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for dev environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/dev/config"
      + tags           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.prod_config will be created
  + resource "aws_ssm_parameter" "prod_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for prod environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/prod/config"
      + tags           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.qa_config will be created
  + resource "aws_ssm_parameter" "qa_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for qa environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/qa/config"
      + tags           = {
          + "Environment" = "qa"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "qa"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.shared_config will be created
  + resource "aws_ssm_parameter" "shared_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for shared environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/shared/config"
      + tags           = {
          + "Environment" = "shared"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "shared"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # null_resource.dev will be destroyed
  # (because null_resource.dev is not in configuration)
  - resource "null_resource" "dev" {
      - id = "1325833302524151943" -> null
    }

  # null_resource.prod will be destroyed
  # (because null_resource.prod is not in configuration)
  - resource "null_resource" "prod" {
      - id = "5105306259574484762" -> null
    }

  # null_resource.qa will be destroyed
  # (because null_resource.qa is not in configuration)
  - resource "null_resource" "qa" {
      - id = "3433261662205872602" -> null
    }

  # null_resource.shared will be destroyed
  # (because null_resource.shared is not in configuration)
  - resource "null_resource" "shared" {
      - id = "378608383326125785" -> null
    }

Plan: 4 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (PROD)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |             RESOURCE              |
|--------|-----------------------------------|
| add    | `aws_ssm_parameter.dev_config`    |
|        | `aws_ssm_parameter.prod_config`   |
|        | `aws_ssm_parameter.qa_config`     |
|        | `aws_ssm_parameter.shared_config` |
| delete | `null_resource.dev`               |
|        | `null_resource.prod`              |
|        | `null_resource.qa`                |
|        | `null_resource.shared`            |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p PROD
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>


<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_ssm_parameter.dev_config will be created
  + resource "aws_ssm_parameter" "dev_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for dev environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/dev/config"
      + tags           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.prod_config will be created
  + resource "aws_ssm_parameter" "prod_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for prod environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/prod/config"
      + tags           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.qa_config will be created
  + resource "aws_ssm_parameter" "qa_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for qa environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/qa/config"
      + tags           = {
          + "Environment" = "qa"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "qa"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.shared_config will be created
  + resource "aws_ssm_parameter" "shared_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for shared environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/shared/config"
      + tags           = {
          + "Environment" = "shared"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "shared"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # null_resource.dev will be destroyed
  # (because null_resource.dev is not in configuration)
  - resource "null_resource" "dev" {
      - id = "4242276329567508007" -> null
    }

  # null_resource.prod will be destroyed
  # (because null_resource.prod is not in configuration)
  - resource "null_resource" "prod" {
      - id = "7032609159755238168" -> null
    }

  # null_resource.qa will be destroyed
  # (because null_resource.qa is not in configuration)
  - resource "null_resource" "qa" {
      - id = "2349978941976690123" -> null
    }

  # null_resource.shared will be destroyed
  # (because null_resource.shared is not in configuration)
  - resource "null_resource" "shared" {
      - id = "70961865836802200" -> null
    }

Plan: 4 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (QA)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |             RESOURCE              |
|--------|-----------------------------------|
| add    | `aws_ssm_parameter.dev_config`    |
|        | `aws_ssm_parameter.prod_config`   |
|        | `aws_ssm_parameter.qa_config`     |
|        | `aws_ssm_parameter.shared_config` |
| delete | `null_resource.dev`               |
|        | `null_resource.prod`              |
|        | `null_resource.qa`                |
|        | `null_resource.shared`            |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p QA
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>


<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_ssm_parameter.dev_config will be created
  + resource "aws_ssm_parameter" "dev_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for dev environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/dev/config"
      + tags           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.prod_config will be created
  + resource "aws_ssm_parameter" "prod_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for prod environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/prod/config"
      + tags           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.qa_config will be created
  + resource "aws_ssm_parameter" "qa_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for qa environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/qa/config"
      + tags           = {
          + "Environment" = "qa"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "qa"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.shared_config will be created
  + resource "aws_ssm_parameter" "shared_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration parameter for shared environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s_deployment/shared/config"
      + tags           = {
          + "Environment" = "shared"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "shared"
          + "ManagedBy"   = "terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # null_resource.dev will be destroyed
  # (because null_resource.dev is not in configuration)
  - resource "null_resource" "dev" {
      - id = "4258326423801149508" -> null
    }

  # null_resource.prod will be destroyed
  # (because null_resource.prod is not in configuration)
  - resource "null_resource" "prod" {
      - id = "5790445156167865581" -> null
    }

  # null_resource.qa will be destroyed
  # (because null_resource.qa is not in configuration)
  - resource "null_resource" "qa" {
      - id = "9020765786532430695" -> null
    }

  # null_resource.shared will be destroyed
  # (because null_resource.shared is not in configuration)
  - resource "null_resource" "shared" {
      - id = "2099058177563623054" -> null
    }

Plan: 4 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (SHARED)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |             RESOURCE              |
|--------|-----------------------------------|
| add    | `aws_ssm_parameter.dev_config`    |
|        | `aws_ssm_parameter.prod_config`   |
|        | `aws_ssm_parameter.qa_config`     |
|        | `aws_ssm_parameter.shared_config` |
| delete | `null_resource.dev`               |
|        | `null_resource.prod`              |
|        | `null_resource.qa`                |
|        | `null_resource.shared`            |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p SHARED
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>